PeterVranken/TRK-USB-MPC5643L/LSM/RTOS/code/mai_main.c
    /* Check consistency of got data. +1: The last entry is meant for the idle task. */
    unsigned int u;
    for(u=0; u<noTasks+1; ++u)
        cntAllTasksCpy -= cntTaskAryCpy[u];
    assert(cntAllTasksCpy == 0);

    /* Get all task counters and the common counter again in an atomic operation. Now, we
       apply the third offered mechanism for mutual exclusion of tasks to include it into
       the test.
         Note, this code requires that we are not yet inside a critical section; it's a
       non-nestable call. */
    ihw_suspendAllInterrupts();
    {
        memcpy(&cntTaskAryCpy[0], (void*)&_cntTaskAry[0], sizeof(cntTaskAryCpy));
        cntAllTasksCpy = _cntAllTasks;
    }
    ihw_resumeAllInterrupts();

    /* Check consistency of got data. +1: The last entry is meant for the idle task. */
    for(u=0; u<noTasks+1; ++u)
        cntAllTasksCpy -= cntTaskAryCpy[u];
    assert(cntAllTasksCpy == 0);

} /* End of checkAndIncrementTaskCnts. */




/**
 * Test function for priority ceiling portocol. To be called from a sub-set of tasks, idle
 * task, task1ms and taskCpuLoad.
 *   The test is aimed to prove the correct implementation of the offered mutual exclusion
 * mechanism for this sub-set of tasks.
 *   @param idTask
 * The ID (or index) of the calling task. Needed to identify the task related counter.
 */
static void testPCP(unsigned int idTask)
{
    /* Increment task related counter and shared counter in an atomic operation. */
    if(idTask == pseudoIdTaskIdle)
    {
        GetResource(RESOURCE_TEST_PCP);
        {
            ++ _sharedDataTasksIdleAnd1msAndCpuLoad.cntTaskIdle;
            ++ _sharedDataTasksIdleAnd1msAndCpuLoad.cntTotal;
        }
        ReleaseResource();
    }
    else if(idTask == idTaskCpuLoad)
    {
        GetResource(RESOURCE_TEST_PCP);
        {
            ++ _sharedDataTasksIdleAnd1msAndCpuLoad.cntTaskCpuLoad;
            ++ _sharedDataTasksIdleAnd1msAndCpuLoad.cntTotal;
        }
        ReleaseResource();
    }
    else if(idTask == idTask1ms)
    {
        /* Here, we want to prove that the resource doesn't need to be acquired by a task,
           which has the highest priority in the sub-set. Omitting the critical section
           code invalidates the code if the task priorities are redefined in the heading
           part of the file and we need to put an assertion to double check this. */
        _Static_assert( prioTask1ms >= prioTaskIdle  &&  prioTask1ms >= prioTask1ms
                      , "Task priorities do not meet the requirements of function testPCP"
                      );
        ++ _sharedDataTasksIdleAnd1msAndCpuLoad.cntTask1ms;
        ++ _sharedDataTasksIdleAnd1msAndCpuLoad.cntTotal;
    }
    else
    {
        /* This function is intended only for a sub-set of tasks. */
        assert(false);
    }

    /* Validate the consistency of the redundant data in an atomic operation. */
    GetResource(RESOURCE_TEST_PCP);
    {
        const unsigned int sum = _sharedDataTasksIdleAnd1msAndCpuLoad.cntTaskIdle
                                 + _sharedDataTasksIdleAnd1msAndCpuLoad.cntTaskCpuLoad
                                 + _sharedDataTasksIdleAnd1msAndCpuLoad.cntTask1ms;
        if(sum != _sharedDataTasksIdleAnd1msAndCpuLoad.cntTotal)
        {
            /* Resynchronize to enable further error recognition. */
            _sharedDataTasksIdleAnd1msAndCpuLoad.cntTotal = sum;
            
            const unsigned int noErr = _sharedDataTasksIdleAnd1msAndCpuLoad.noErrors+1;
            if(noErr > 0)
                _sharedDataTasksIdleAnd1msAndCpuLoad.noErrors = noErr;
           
            /* The application is halted in DEBUG compilation. This makes the error
               observable without connected terminal. */
            assert(false);
        }
    }
    ReleaseResource();

} /* End of testPCP. */




/**
 * This function produces some CPU load for testing. A busy loop is executed for a give
 * duration. Note, this does not necessarily mean a 100% of load during this time span; a
 * task calling this function can be preempted and the time would elapse without the task
 * producing load.
 *   @param fullLoadThisNoMicroseconds
 * The duration in us during which the busy loop is executed. The function returns after
 * about this time, regardless whether it had produced load or whether it had mostly been
 * preempted.
 */
static void produceLoad(unsigned int fullLoadThisNoMicroseconds)
{
    /* The factor 120 is required to consider the unit of __builtin_ppc_get_timebase(),
       which is the CPU clock tick. */
    const uint64_t tiEnd = __builtin_ppc_get_timebase() + fullLoadThisNoMicroseconds*120;

    /* Busy loop. Note, preemption is possible, which effectively lowers the additional CPU
       load, this loop produces. The higher the system load, the more grows this effect. */
    while(__builtin_ppc_get_timebase() < tiEnd)
        ;
} /* End of produceLoad */



/**
 * Task function, cyclically activated every Millisecond. The LED D4 is switched on and off
 * and the button SW3 is read and evaluated.
 */
static void task1ms()
{
    checkAndIncrementTaskCnts(idTask1ms);
    testPCP(idTask1ms);

    ++ mai_cntTask1ms;

    /* Activate the non cyclic task.
         Note, the non cyclic task is of higher priority than this task and it'll be
       executed immediatly, preempting this task. The second activation below, on button
       down must not lead to an activation loss.
         Note, activating one and the same task from different contexts requires a critical
       section. */
    GetResource(RESOURCE_ACTIVATE_TASK_NON_CYCLIC);
    {
        rtos_activateTask(idTaskNonCyclic);
    }
    ReleaseResource();

    /* Produce a bit of CPU load. This call simulates some true application software. */
    produceLoad(/* fullLoadThisNoMicroseconds */ 50 /* approx. 5% load */);
    
    /* Read the current button status to possibly toggle the LED colors. */
    static bool lastStateButton_ = false;
    if(lbd_getButton(lbd_bt_button_SW3))
    {
        if(!lastStateButton_)
        {
            /* Button down event: Toggle colors */
            static unsigned int cntButtonPress_ = 0;

            lbd_setLED(_ledTask1s, /* isOn */ false);
            lbd_setLED(_ledTask1ms, /* isOn */ false);
            _ledTask1s  = (cntButtonPress_ & 0x1) != 0? lbd_led_D5_red: lbd_led_D5_grn;
            _ledTask1ms = (cntButtonPress_ & 0x2) != 0? lbd_led_D4_red: lbd_led_D4_grn;

            /* Activate the non cyclic task a second time. The priority of the activated
               task is higher than of this activating task so the first activation should
               have been processed meanwhile and this one should be accepted, too.
                 Note, activating one and the same task from different contexts requires a
               critical section. */
#ifdef DEBUG
            bool bActivationAccepted;
#endif
            GetResource(RESOURCE_ACTIVATE_TASK_NON_CYCLIC);
            {
#ifdef DEBUG
                bActivationAccepted =
#endif
                rtos_activateTask(idTaskNonCyclic);
            }
            ReleaseResource();
            assert(bActivationAccepted);

            /* Activate our button down event task. The activation will normally succeed
               but at high load and very fast button press events it it theoretically
               possible that not. We don't place an assertion. */
#ifdef DEBUG
            bActivationAccepted =
#endif
            rtos_activateTask(idTaskOnButtonDown);
            //assert(bActivationAccepted);

